app/Controllers/Auth.php

    public function verifyOtp()
{
    $otp = $this->request->getPost('otp');
    $userModel = new UserModel();

    // Find the user by OTP
    $user = $userModel->where('otp', $otp)->first();

    if ($user) {
        // Update the user's verification status and clear the OTP
        $userModel->update($user['id'], ['is_verified' => 1, 'otp' => null]);
---
SELECT *
FROM `users`
WHERE `otp` = '584330'
 LIMIT 1
UPDATE `users` SET `is_verified` = 1, `otp` = NULL
WHERE `users`.`id` IN ('4')

    public function loginUser()
    {
        // Validate User Input Data
        $validated = $this->validate([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[5]|max_length[12]',
        ]);

        if (!$validated) {
            return view('auth/login', ['validation' => $this->validator]);
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        // Retrieve the user by email
        $user = $userModel->where('Email', trim($email))->first();
---
SELECT *
FROM `users`
WHERE `Email` = 'amanuelkassahun18@gmail.com'
 LIMIT 1

public function dashboard()
{
    // Check if the user is logged in
    if (!session()->get('logged_in')) {
        return redirect()->to('/auth')->with('fail', 'You must log in first.');
    }

    // Get user details from the session
    $userModel = new UserModel();
    $user = $userModel->find(session()->get('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'