app/Controllers/BlogController.php

        public function index()
    {
        $data['blogs'] = $this->blogModel->findAll();
---
SELECT *
FROM `blogs`

        public function edit($id)
        {
            $data['blog'] = $this->blogModel->find($id);
---
SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '13'

        public function update($id)
    {
        $validated = $this->validate([
            'title' => 'required',
            'content' => 'required',
            'image' => 'max_size[image,18432]|is_image[image]|mime_in[image,image/jpg,image/jpeg,image/png,image/gif,image/webp]',
        ]);

        if (!$validated) {
            return view('blog/edit', ['validation' => $this->validator,
            'blog' => $this->blogModel->find($id)]);
---
SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '25'

    public function view($id)
    {
        // Fetch the current blog post
        $blog = $this->blogModel->find($id);
        if (!$blog) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Blog post not found');
        }

        // Fetch other blog posts to recommend, excluding the current one
        $relatedBlogs = $this->blogModel->where('id !=', $id)->findAll(3); // Fetch 3 other blog posts
---
SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '16'
SELECT *
FROM `blogs`
WHERE `id` != '16'
 LIMIT 3

    public function delete($id)
    {
        $blog = $this->blogModel->find($id);
        if (!$blog) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Blog post not found');
        }

        if ($blog['user_id'] != session()->get('user_id')) {
            return redirect()->to('/blog')->with('error',
            'You are not authorized to delete this blog post.');
        }
        $this->blogModel->delete($id);
---
SELECT *
FROM `blogs`
WHERE `blogs`.`id` = '24'
DELETE FROM `blogs`
WHERE `id` IN ('24')